# Rehost Method (SketchPlane, XYZ)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..Rehost Method (SketchPlane, XYZ)
Form Class See Also
---
Rehost Form to sketch plane
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void Rehost(
	SketchPlane sketchPlane,
	XYZ location
)
```

Visual Basic
---
```text
Public Sub Rehost ( _
	sketchPlane As SketchPlane, _
	location As XYZ _
)
```

Visual C++
---
```text
public:
void Rehost(
	SketchPlane^ sketchPlane,
	XYZ^ location
)
```

# ### Parameters
sketchPlane
    Type: Autodesk.Revit.DB..::..SketchPlaneThe sketch plane on which to rehost the form.
location
    Type: Autodesk.Revit.DB..::..XYZThe location to which to Rehost the form.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the sketchPlane or location is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when rehosting Form failed. |

# See Also
Form Class
Rehost Overload
Autodesk.Revit.DB Namespace